# Homebrew Cask https://github.com/Homebrew/homebrew-cask
tap "homebrew/cask"

# Adobe Creative Cloud https://www.adobe.com/creativecloud.html
cask "adobe-creative-cloud"
# CraftManager https://www.invisionapp.com/craft
cask "craftmanager"
# Docker https://www.docker.com/products/docker-desktop
cask "docker"
# Dropbox https://www.dropbox.com
cask "dropbox"
# Figma https://www.figma.com
cask "figma"
# Firefox https://www.mozilla.org/firefox/
cask "firefox"
# FontForge https://fontforge.org
cask "fontforge"
# fontplop https://github.com/matthewgonzalez/fontplop
cask "fontplop"
# Google Chrome https://www.google.com/chrome/
cask "google-chrome"
# iTerm https://www.iterm2.com
cask "iterm2"
# Kap https://getkap.co
cask "kap"
# Keka https://www.keka.io
cask "keka"
# LibreOffice https://www.libreoffice.org
cask "libreoffice"
# Little Snitch https://www.obdev.at/products/littlesnitch/
cask "little-snitch"
# OpenOffice https://www.openoffice.org
cask "openoffice"
# Poedit https://poedit.net
cask "poedit"
# QuodLibet https://quodlibet.readthedocs.io
cask "quodlibet"
# Runway https://runwayml.com
cask "runway"
# Sketch https://www.sketch.com
cask "sketch"
# Skype https://www.skype.com
cask "skype"
# Steam https://store.steampowered.com
cask "steam"
# Sublime Merge https://www.sublimemerge.com
cask "sublime-merge"
# Sublime Text https://www.sublimetext.com
cask "sublime-text"
# Transmission https://transmissionbt.com
cask "transmission"
# VLC https://www.videolan.org/vlc/
cask "vlc"

# Antibody https://getantibody.github.io
brew "antibody"
# asdf https://asdf-vm.com
brew "asdf"
# Composer https://getcomposer.org
brew "composer"
# Coreutils https://www.gnu.org/software/coreutils/
brew "coreutils"
# Docker Compose https://docs.docker.com/compose/
brew "docker-compose"
# ffmpeg https://ffmpeg.org
brew "ffmpeg"
# Git LFS https://github.com/git-lfs/git-lfs
brew "git-lfs"
# GnuPG https://gnupg.org
brew "gnupg"
# ImageMagick https://imagemagick.org
brew "imagemagick"
# lazydocker https://github.com/jesseduffield/lazydocker
brew "jesseduffield/lazydocker/lazydocker"
# jq https://stedolan.github.io/jq/
brew "jq"
# Mac App Store command line interface https://github.com/mas-cli/mas
brew "mas"
# pastel https://github.com/sharkdp/pastel
brew "pastel"
# ssh-copy-id https://formulae.brew.sh/formula/ssh-copy-id
brew "ssh-copy-id"
# tree http://mama.indstate.edu/users/ice/tree/
brew "tree"
# youtube-dl https://youtube-dl.org
brew "youtube-dl"

# HP Easy Scan https://apps.apple.com/us/app/hp-easy-scan/id967004861
mas "HP Easy Scan", id: 967004861
# Numbers https://apps.apple.com/us/app/numbers/id409203825
mas "Numbers", id: 409203825
# Pocket https://apps.apple.com/us/app/numbers/id568494494
mas "Pocket", id: 568494494
