# 🍺 Homebrew https://github.com/Homebrew/brew
# 📝 Browse all formulae: https://formulae.brew.sh/formula/
#
# asdf https://asdf-vm.com
brew "asdf"
# Chromaprint https://acoustid.org/chromaprint
brew "chromaprint"
# Composer https://getcomposer.org
brew "composer"
# Coreutils https://www.gnu.org/software/coreutils/
brew "coreutils"
# Docker Compose https://docs.docker.com/compose/
brew "docker-compose"
# exa https://the.exa.website
brew "exa"
# ffmpeg https://ffmpeg.org
brew "ffmpeg"
# Git LFS https://github.com/git-lfs/git-lfs
brew "git-lfs"
# GnuPG https://gnupg.org
brew "gnupg"
# ImageMagick https://imagemagick.org
brew "imagemagick"
# lazydocker https://github.com/jesseduffield/lazydocker
brew "jesseduffield/lazydocker/lazydocker"
# jq https://stedolan.github.io/jq/
brew "jq"
# Mac App Store command line interface https://github.com/mas-cli/mas
brew "mas"
# OpenSSL https://www.openssl.org
brew "openssl"
# pastel https://github.com/sharkdp/pastel
brew "pastel"
# Python https://formulae.brew.sh/formula/python@3.9
# More informations: https://docs.brew.sh/Homebrew-and-Python
brew "python3"
# Readline https://tiswww.case.edu/php/chet/readline/rltop.html
brew "readline"
# tmux https://tmux.github.io
brew "tmux"
# youtube-dl https://youtube-dl.org
brew "youtube-dl"

# 🍺 Homebrew Cask https://github.com/Homebrew/homebrew-cask
# 📝 Browse all casks: https://formulae.brew.sh/cask/
tap "homebrew/cask"

# Adobe Creative Cloud https://www.adobe.com/creativecloud.html
cask "adobe-creative-cloud"
# Docker https://www.docker.com/products/docker-desktop
cask "docker"
# Dropbox https://www.dropbox.com
cask "dropbox"
# Firefox https://www.mozilla.org/firefox/
cask "firefox"
# fontplop https://github.com/matthewgonzalez/fontplop
cask "fontplop"
# Google Chrome https://www.google.com/chrome/
cask "google-chrome"
# Kap https://getkap.co
cask "kap"
# Keka https://www.keka.io
cask "keka"
# Little Snitch https://www.obdev.at/products/littlesnitch/
#
# 20201126
# I install Little Snitch in version 4 because version 5 requires >= macOS Big Sur
# See related cask:
# https://github.com/Homebrew/homebrew-cask-versions/blob/master/Casks/little-snitch4.rb
# —Maylis
cask "little-snitch4"
# OpenOffice https://www.openoffice.org
cask "openoffice"
# QuodLibet https://quodlibet.readthedocs.io
cask "quodlibet"
# Steam https://store.steampowered.com
cask "steam"
# Sublime Merge https://www.sublimemerge.com
cask "sublime-merge"
# Sublime Text https://www.sublimetext.com
cask "sublime-text"
# VLC https://www.videolan.org/vlc/
cask "vlc"

# 🍺 Homebrew Cask Fonts https://github.com/Homebrew/homebrew-cask-fonts
tap "homebrew/cask-fonts"

# JetBrains Mono https://www.jetbrains.com/lp/mono/
cask "font-jetbrains-mono"

# 🍺 Mac App Store command line interface
#
# HP Easy Scan https://apps.apple.com/us/app/hp-easy-scan/id967004861
mas "HP Easy Scan", id: 967004861
# Numbers https://apps.apple.com/us/app/numbers/id409203825
mas "Numbers", id: 409203825
# Pages https://apps.apple.com/us/app/pages/id409201541
mas "Pages", id: 409201541
# Pocket https://apps.apple.com/us/app/numbers/id568494494
mas "Pocket", id: 568494494
